
** Preview the dataset
Any EDA process will probably begin by inspecting a subset of data. For a pandas DataFrame, this can be done by using the .head() method:

#+begin_src python :results output
import pandas as pd

bb = pd.read_csv('baseball_2016.csv')
print(bb.head())

#+end_src

#+RESULTS:
:    Unnamed: 0  attendance  ... home_team_loss  home_team_outcome
: 0           0     40030.0  ...              0                Win
: 1           1     21621.0  ...              0                Win
: 2           2     12622.0  ...              0                Win
: 3           3     18531.0  ...              1               Loss
: 4           4     18572.0  ...              1               Loss
: 
: [5 rows x 26 columns]

By looking at the first few rows of the data, we can often figure out what kind of data we have (eg., discrete or continous) and get a sense of how they are coded. For example, we can see that attendance, temperature, and total_runs are numbers, while game_type, day_of_week, and sky appear to be text.

After our initial inspection, we'll want to dig deeper to investigate the following:

    - The data type of each variable.
    - How discrete/categorical data is coded (and whether we need to make any changes).
    - How the data are scaled.
    - Whether there is missing data and how it is coded.
    - Wheter there are outliers.
    - The distributions of continuos features.
    - The relationships between pairs of features.

